FamInstAnalyticalHelper.getAMPlane(FamilyInstance!System.Runtime.CompilerServices.IsConst*,System.Int32,AnalyticalDirection.Enum,ElementId)
getAMPlane() is general method. Probably it will not work for most cases.
If particular case can not be handled by that function, handle that case in derived class

FamInstAnalyticalHelper.createZeroLengthAnalyticalModelLine(System.Double!System.Runtime.CompilerServices.IsConst(*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)[N3])
Sometimes projecting line to plane gives a point. Because we do not want to change type,
we crate line that length is 0.8 DOUBLE_EPS. To detect point, compare line length with DOUBLE_EPS

FamInstAnalyticalHelper.getProjectedAnalyticalModel
On error NULL is returned, otherwise projected (moved to one of 9 cardinal points or projected to reference plane,
level etc) AM curve is returned. In case of shorting AM to point (like projecting vertical column to level),
very short line is returned.